const LENTILS = [
  ["שעועית לבנה","0.5","3","כוס","כוסות"],
  ["שעועית שחורה","0.66","4","כוס","כוסות"],
  ["שעועית מנומרת","1","4","כוס","כוסות"],
  ["שעועית בובס ענק","0.5","3","כוס","כוסות"],
  ["שעועית לוביה","1","4","כוס","כוסות"],
  ["שעועית אדומה","1","3","כוס","כוסות"],
  ["גרגרי חומוס ענק","1","3","כוס","כוסות"],
  ["גרגרי חומוס אתיופי קטן","1","2","כוס","כוסות"],
  ["גרגרי חומוס קטן","1","2","כוס","כוסות"],
  ["גרגרי חומוס בינוני","1","3","כוס","כוסות"],
  ["גרגרי חומוס גדול","0.5","2","כוס","כוסות"],
  ["גריסים","1","3","כוס","כוסות"],
  ["חיטה","1","3","כוס","כוסות"],
  ["דוחן","0.25","2","כוס","כוסות"],
  ["עדשים כתומות","1","2","כוס","כוסות"],
  ["עדשים ירוקות","1","2","כוס","כוסות"],
  ["עדשים שחורות","1","2","כוס","כוסות"],
  ["עדשים ירוקות קטנות","1","2","כוס","כוסות"],
  ["עדשים מנומרות","1","2","כוס","כוסות"],
  ["אפונה ירוקה","0.25","2","כוס","כוסות"],
  ["אפונה צהובה","0.25","2","כוס","כוסות"],
  ["אפונה צהובה טריה","1","2","כוס","כוסות"],
  ["שעועית מש","0.25","2","כוס","כוסות"],
  ["קינואה בהירה","0.5","2","כוס","כוסות"],
  ["קינואה שחורה","0.5","2","כוס","כוסות"],
  ["קינואה אדומה","0.5","2","כוס","כוסות"],
  ["אורז פרסי","0.5","2","כוס","כוסות"],
  ["אורז בסמטי הודי","0.5","2","כוס","כוסות"],
  ["אורז עגול לסושי סוגת","0.5","2","כוס","כוסות"],
  ["אורז תאילנדי","0.5","2","כוס","כוסות"],
  ["אורז מלא ארוך","0.5","2","כוס","כוסות"],
  ["אורז שחור","0.25","2","כוס","כוסות"],
  ["אורז אדום","0.25","2","כוס","כוסות"],
  ["גרגרי טף","0.25","1","כוס","כוסות"],
]
const SPICES = [
  ["מלח","1","5","כפית","כפיות"],
  ["מלח הימלאיה ורוד","1","5","כפית","כפיות"],
  ["מלח הודי שחור","1","5","כפית","כפיות"],
  ["פלפל שחור","0.25","3","כפית","כפיות"],
  ["פפריקה מתוקה","0.25","7","כפית","כפיות"],
  ["פפריקה חריפה","0.25","3","כפית","כפיות"],
  ["פלפל לבן טחון","0.25","3","כפית","כפיות"],
  ["פלפל שחור גרוס עבה","0.25","3","כפית","כפיות"],
  ["כורכום","0.25","3","כפית","כפיות"],
  ["ראס אל חנות","0.25","3","כפית","כפיות"],
  ["כמון טחון","0.25","3","כפית","כפיות"],
  ["זרעי כמון","0.25","3","כפית","כפיות"],
  ["זרעי חילבה","0.25","3","כפית","כפיות"],
  ["זרעי חרדל שחור","0.25","3","כפית","כפיות"],
  ["זרעי חרדל צהוב","0.25","3","כפית","כפיות"],
  ["זרעי כוסברה","0.25","3","כפית","כפיות"],
  ["קינמון","0.25","3","כפית","כפיות"],
  ["פלפל שאטה טחון","0.25","10","כפית","כפיות"],
  ["צ'ילי גרוס","0.25","3","כפית","כפיות"],
  ["מוסקט","0.25","3","כפית","כפיות"],
  ["הל ירוק","0.25","2","כפית","כפיות"],
  ["הל שחור","0.25","2","כפית","כפיות"],
  ["ציפורן","0.25","2","כפית","כפיות"],
  ["מחית קארי ירוק","0.25","2","כפית","כפיות"],
  ["מחית קארי אדום","0.25","2","כפית","כפיות"],
  ["טימין","1","5","כפית","כפיות"],
  ["אורגנו","1","5","כפית","כפיות"],
  ["זעתר","1","4","כפית","כפיות"],
  ["טימין לימוני","1","5","כפית","כפיות"],
  ["רוזמרין","0.25","1","כפית","כפיות"],
  ["בזיליקום","1","3","כפית","כפיות"],
  ["טימין","1","5","כפית","כפיות"],
]
const MEAT = [
  ["חזה עוף חתוך לקוביות","0.25","3","ק\"ג",""],
  ["חזה עוף חתוך לפרוסות","0.25","3","ק\"ג",""],
  ["חזה עוף שלם","0.25","3","ק\"ג",""],
  ["שוקיים עוף","0.25","3","ק\"ג",""],
  ["כרעיים עוף","0.25","3","ק\"ג",""],
  ["כנפיים","0.25","3","ק\"ג",""],
  ["שוקיים הודו","0.25","3","ק\"ג",""],
  ["חזה הודו חתוך לקוביות","0.25","3","ק\"ג",""],
  ["בשר מספר 2","0.25","3","ק\"ג",""],
  ["נתח בשר מספר 5","0.25","3","ק\"ג",""],
  ["נתח בשר מספר 8","0.25","3","ק\"ג",""],
  ["נתח אנטריקוט","0.25","3","ק\"ג",""],
  ["אסאדו","0.25","3","ק\"ג",""],
  ["אסאדו כבש","0.25","3","ק\"ג",""],
  ["אסאדו עז","0.25","3","ק\"ג",""],
  ["אסאדו גמל","0.25","3","ק\"ג",""],
  ["נתח בשר מספר 3","0.25","3","ק\"ג",""],
  ["נתח בשר מספר 4","0.25","3","ק\"ג",""],
  ["נתח בשר מספר 6","0.25","3","ק\"ג",""],
  ["נתח בשר מספר 7","0.25","3","ק\"ג",""],
  ["נתח בשר מספר 9","0.25","3","ק\"ג",""],
  ["נתח בשר מספר π","0.25","3","ק\"ג",""],
]
const FISH = [
  ["פילה סלמון מעושן","0.25","1","ק\"ג",""],
  ["פילה נסיכה חתוך לקוביות גסות","0.25","3","ק\"ג",""],
  ["פילה קרפיון חתוך לקוביות גסות","0.25","3","ק\"ג",""],
  ["פילה דניס חתוך לקוביות גסות","0.25","3","ק\"ג",""],
  ["פילה הליבוט חתוך לקוביות גסות","0.25","3","ק\"ג",""],
  ["פילה בס חתוך לקוביות גסות","0.25","3","ק\"ג",""],
  ["פילה סול חתוך לקוביות גסות","0.25","3","ק\"ג",""],
  ["פילה אמנון חתוך לקוביות גסות","0.25","3","ק\"ג",""],
  ["פילה בורי חתוך לקוביות גסות","0.25","3","ק\"ג",""],
]
const VEGETARIAN = [
  ["ביצה","1","5","ביצה","ביצים"],
  ["גבינת קממבר","100","500","גרם",""],
  ["גבינת רוקפור","100","500","גרם",""],
  ["גבינה כחולה","100","500","גרם",""],
  ["גבינה לבנה","100","500","גרם",""],
  ["גבינת צהובה","100","200","גרם",""],
  ["גבינת קממבר","100","500","גרם",""],
]
const VEGAN = [
  ["טופו רך","50","300","גרם",""],
  ["טופו מעושן","50","300","גרם",""],
  ["טופו חומוס","50","300","גרם",""],
  ["טופו קשה","50","300","גרם",""],
  ["גבינת קשיו","100","500","גרם",""],
  ["שבבי סויה עבים","15","50","גרם",""],
  ["נתחי סייטן","15","100","גרם",""],
]
const NUTS = [
  ["אגוז מלך","15","50","גרם",""],
  ["אגוז ברזיל","15","50","גרם",""],
  ["אגוז לוז","15","50","גרם",""],
  ["אגוז פקאן","15","50","גרם",""],
  ["אגוז מקדמיה","15","50","גרם",""],
  ["אגוז קשיו","15","50","גרם",""],
  ["בוטנים מלוחים","15","50","גרם",""],
  ["אגוז פיסטוק","15","50","גרם",""],
  ["שבבי קוקוס גדולים","15","50","גרם",""]
]
const VEGETABLES = [
  ["בצל","1","4","יחידות",""],
  ["שום","1","4","ראש","ראשים"],
  ["תפוח אדמה","1","8","יחידות",""],
  ["בטטה","1","4","יחידות",""],
  ["כרוב לבן","1","4","יחידות",""],
  ["דלורית","1","4","יחידות",""],
  ["דלעת","0.5","2","ק\"ג",""],
  ["בטטה סגולה","1","4","יחידות",""],
  ["סלק","1","4","יחידות",""],
  ["גזר","1","4","יחידות",""],
  ["שורש סלרי","1","2","יחידות",""],
  ["שורש פטרוזיליה","1","4","יחידות",""],
  ["שורש ג'ינגר מגורד","1","4","ס\"מ",""],
  ["שורש כורכום מגורד","1","4","ס\"מ",""],
  ["סלרי אמריקאי","1","4","גבעול","גבעולים"],
  ["קישוא","1","2","יחידות",""],
  ["כרישה","0.5","2","יחידה","יחידות"],
  ["עגבנייה","1","3","יחידה","יחידות"],
  ["עגבניות שרי אדומות","2","9","יחידה","יחידות"],
  ["עגבניות שרי צהובות","2","9","יחידה","יחידות"],
  ["עגבניות שרי כתומות","2","9","יחידה","יחידות"],
  ["עגבניות שרי מנומרות","2","9","יחידה","יחידות"],
  ["עגבניות שרי ירוקות","2","9","יחידה","יחידות"],
  ["צנון","0.5","2","יחידה","יחידות"],
  ["שורש חזרת","0.5","2","יחידה","יחידות"],
  ["קלח תירס","0.5","2","יחידה","יחידות"],
  ["דלעת ערמונים","0.5","2","יחידה","יחידות"],
  ["דלעת תאילנדית קטנה","0.5","1","יחידה",""],
  ["ברוקולי","0.5","1","יחידה",""],
  ["כרובית","0.5","1","יחידה",""],
]
const LEAVES = [
  ["עלי תרד","1","5","עלה","עלים"],
  ["עלי פטרוזיליה","0.25","1","חבילה",""],
  ["עלי כוסברה","0.25","1","חבילה",""],
  ["עלי שמיר","0.25","1","חבילה",""],
  ["עלי רוקט","0.25","1","חבילה",""],
  ["עלי מנגולד","0.25","1","חבילה",""],
  ["עלי זעתר טרי","1","10","עלה","עלים"],
]
const SAUCES = [
  ["רוטב סויה","1","6","כף","כפות"],
  ["רוטב צ'ילי","1","6","כף","כפות"],
  ["רוטב טריאקי","1","6","כף","כפות"],
  ["רוטב סויה לימון קיקומן","1","6","כף","כפות"],
  ["דבש","1","6","כף","כפות"],
  ["רוטב רימונים","1","6","כף","כפות"],
  ["רוטב לימון","1","6","כף","כפות"],
  ["עשן נוזלי","1","6","טיפה","טיפות"],
  ["סילאן תמרים","1","6","כף","כפות"],
  ["סילאן חרובים","1","6","כף","כפות"],
]
const EXTRAS = [
  ["ופל שוקולד מן","1","5","יחידה","יחידות"],
  ["ופל מוקה מן","1","5","יחידה","יחידות"],
  ["ופל לימון מן","1","5","יחידה","יחידות"],
  ["מרשמלו","1","5","יחידה","יחידות"],
  ["ביסלי גריל","1","10","יחידה","יחידות"],
  ["נחש גומי","1","5","יחידה","יחידות"],
  ["מרשמלו","1","5","יחידה","יחידות"],
  ["שוקולד מריר 60 אחוז","1","9","קוביה","קוביות"],
  ["קקאו","0.5","2","כפית","כפיות"],
  ["חלבה","50","200","גרם",""],
  ["סירופ לשיעול הדס","1","3","כף","כפות"],
  ["ערק","1","6","כף","כפות"],
  ["וודקה אוכמניות","1","6","כף","כפות"],
  ["מיץ אשכולית","0.25","1","כוס",""],
  ["מיץ תפוזים","0.25","1","כוס",""],
  ["מיץ גויאבה איילנד","0.25","1","כוס",""],
  ["גויאבה","1","2","יחידה","יחידות"],
  ["אבוקדו קשה מקולף","1","2","יחידה","יחידות"],
  ["חוגר","1","5","תעודת","תעודות"],
  ["אבק ממתחת לספה","1","5","מ״ג",""],
  ["סלוטייפ חבלה","1","3","מטר","מטרים"],
  ["חצייה","1","3","מעבר","מעברי"],
  ["דם נוצרים","50","250","מ״ל",""],
  ["שוקולד השחר","1","5","כף","כפות"],
  ["קריסטל בטעם אקזוטי","0.5","2","בקבוק","בקבוקים"],
  ["במבה אדומה","1","3","חבילה","חבילות"],
  ["אתה לא אדמין","100","100","אחוז",""],
]

const INGREDIENTS = { LENTILS: LENTILS, SPICES: SPICES, MEAT: MEAT, FISH: FISH, VEGETARIAN: VEGETARIAN, VEGAN: VEGAN, NUTS: NUTS, VEGETABLES: VEGETABLES, LEAVES: LEAVES, SAUCES: SAUCES, EXTRAS: EXTRAS }

const FAMILY_RELATIONS = ['אמא', 'סבתא', 'הדודה', 'סבא', 'המלכה', 'החברה של אמא', 'יריבתך המושבעת']
const KNOWN_FROM = ['משאבי אנוש', 'מחלקת שכר', 'המנהל הקהילתי', 'מחלקת מו״פ', 'ההוצאה לפועל', 'ועד ההורים', 'הועד']
const NAMES = ['שרה', 'רבקה', 'חווה', 'מעמולה', 'לאה', 'קיילי מינוג', 'ניצה', 'אביבה', 'איציק', 'מוטי', 'שולה', 'רוחמה', 'אסתר', 'אסתי', 'שושי', 'שוש', 'מינרבה', 'רחל', 'עליזה', 'ארנה', 'ברטיסלבה', 'אשתורת', 'לואיזה', 'דינה', 'מסעודה', 'מזל', 'מרסדס', 'ז׳ורז׳ט', 'זֿ׳קלין', 'ליליאן', 'סוליקה', 'פאני', 'מרסל', 'חביבה', 'סימה', 'נחמה', 'רוחמה', 'פרחה', 'עדנה', 'קלמנטין', 'בתיה', 'חמימו', 'מורדוך', 'ברוך', 'ברכה', 'שפרה', 'מלכה', 'מרים', 'פולה', 'הרצל', 'דליה', 'שולה', 'בינה', 'סעדה', 'מרגלית', 'הניה', 'רג׳ינה', 'ג׳ניה', 'פאינה', 'אהובה', 'ברוריה', 'כוכבה']
const LOCATIONS = ['מרקש', 'ג׳רבה', 'טולדו', 'וורשה', 'לודג׳', 'קווקז', 'בוכרה', 'קוצ׳ין', 'חלב', 'רבאט', 'קזבלנקה', 'מגרב', 'טנג׳יר', 'פאס', 'הונגריה', 'פראג', 'נצרת', 'נתניה', 'באר טוביה', 'שדרות', 'אשקלון', 'נתיבות', 'ירוחם', 'טבריה', 'עפולה', 'דימונה']
const LOCATIONS_ADJ = ['מרקשי', 'ג׳רבי', 'טולדאי', 'וורשאי', 'לודג׳אי', 'קווקזי', 'בוכרי', 'קוצ׳יני', 'חלבי', 'רבאטי', 'קזבלנקי', 'מגרבי', 'טנג׳ירי', 'פאסי', 'הונגרי', 'פראגי', 'נצרתי', 'נתנייתי', 'באר טובייתי', 'שדרותי', 'אשקלוני', 'נתיבותי', 'ירוחמאי', 'טברייני', 'עפולאי', 'דימונאי']

const INSTRUCTIONS = [
  'לשים הכל בסיר ולבשל המון זמן.',
  'לשים הכל בסיר ולבשל הרבה זמן.',
  'לשים הכל בסיר ולבשל מלאנתלפים זמן.',
  'לשים הכל בסיר ולבשל המווווון זמן.',
]

const getRandom = (max, min) => Math.floor(Math.random() * (max - (min || 0) + 1)) + (min || 0)
const numOf = (options, num) => Array.from({ length: num }).map(() => options[getRandom(options.length - 1)])

const PATTERNS = [
  ({ MEAT, FISH, LENTILS, NUTS, VEGETABLES, LEAVES, SPICES, SAUCES, EXTRAS }) => [
    ...numOf([MEAT, FISH], 1),
    ...numOf([LENTILS], 3, 1),
    ...numOf([NUTS], getRandom(1)),
    ...numOf([VEGETABLES], getRandom(6, 2)),
    ...numOf([LEAVES, SPICES], getRandom(6, 2)),
    ...numOf([SAUCES], getRandom(2)),
    ...numOf([EXTRAS], Math.max(0, getRandom(3) - 1)),
  ],
  ({ VEGETARIAN, VEGAN, LENTILS, NUTS, VEGETABLES, LEAVES, SPICES, SAUCES, EXTRAS }) => [
    ...numOf([VEGETARIAN, VEGAN], getRandom(2)),
    ...numOf([LENTILS], 3, 1),
    ...numOf([NUTS], getRandom(1)),
    ...numOf([VEGETABLES], getRandom(6, 2)),
    ...numOf([LEAVES, SPICES], getRandom(6, 2)),
    ...numOf([SAUCES], getRandom(2)),
    ...numOf([EXTRAS], Math.max(0, getRandom(3) - 2)),
  ],
  ({ MEAT, FISH, LENTILS, NUTS, VEGETABLES, LEAVES, SPICES, SAUCES, EXTRAS }) => [
    ...numOf([MEAT, FISH], getRandom(1)),
    ...numOf([LENTILS, VEGETABLES, LEAVES], getRandom(4, 1)),
    ...numOf([SPICES], getRandom(2, 1)),
    ...numOf([NUTS], getRandom(1)),
    ...numOf([SAUCES], getRandom(1)),
    ...numOf([EXTRAS], 1),
  ],
]
const TITLE_PATTERNS = [
  () => [
    'החמין',
    ...(getRandom(3) ? [] : [`ה${LOCATIONS_ADJ[getRandom(LOCATIONS_ADJ.length - 1)]}`]),
    'של',
    NAMES[getRandom(NAMES.length - 1)],
    ...(getRandom(2) ? [] : [`מ${KNOWN_FROM[getRandom(KNOWN_FROM.length - 1)]}`]),
    ...(getRandom(8) ? [] : ['(דרסה אותה משאית)']),
  ],
  () => [
    'החמין',
    ...(getRandom(3) ? [] : [`ה${LOCATIONS_ADJ[getRandom(LOCATIONS_ADJ.length - 1)]}`]),
    'של',
    FAMILY_RELATIONS[getRandom(FAMILY_RELATIONS.length - 1)],
    NAMES[getRandom(NAMES.length - 1)],
    ...(getRandom(8) ? [] : ['(דרסה אותה משאית)']),
  ],
  () => [
    'החמין של',
    FAMILY_RELATIONS[getRandom(FAMILY_RELATIONS.length - 1)],
    ...(getRandom(8) ? [] : ['(דרסה אותה משאית)']),
  ],
  () => [
    'חמין נוסח',
    LOCATIONS[getRandom(LOCATIONS.length - 1)]
  ]
]

const makeKnapsack = source => [...source].sort(() => Math.random() - 0.5)
const makeKnapsacks = () => Object.fromEntries(Object.entries(INGREDIENTS).map(([key, val]) => [key, makeKnapsack(val)]))

const getIngredient = ([name, fraction, max, singularUnit, pluralUnit]) => {
    const maxRand = max / fraction - 1
    const amount = Math.floor(Math.random() * maxRand) + 1
    const amountInFractions = amount * fraction
    const unit = amountInFractions > 1 && pluralUnit ? pluralUnit : singularUnit
    return `${amountInFractions} ${unit} ${name}`
}

const getIngredientFromCategory = (category) => getIngredient(category.pop())

const getIngredientList = () => PATTERNS[getRandom(PATTERNS.length - 1)](makeKnapsacks()).map(getIngredientFromCategory).join('\n')
const getRecipeName = () => TITLE_PATTERNS[getRandom(TITLE_PATTERNS.length - 1)]().join(' ')
const getInstructions = () => INSTRUCTIONS[getRandom(INSTRUCTIONS.length - 1)]

const onClick = () => {
  document.querySelector('.ingredients').innerText = getIngredientList()
  document.querySelector('.recipeName').innerText = getRecipeName()
  document.querySelector('.instructions').innerText = getInstructions()
}

document.querySelector('.getRecipe').onclick = onClick
document.addEventListener('DOMContentLoaded', onClick, false);
